In [10]:
print('Hello')

Hello

In [11]:
import pandas as pd

In [12]:
df=pd.read_csv('veg.csv')

In [13]:
df

   id     name                       desc  price          img
0   1  Cabbage  Fresh and Local Products.     56  cabbage.jpg
1   2   Potato  Fresh and Local Products.     70   potato.jpg
2   3    Onion  Fresh and Local Products.     85    onion.jpg
3   4   Tomato  Fresh and Local Products.     60   tomato.jpg
4   5     Rayo  Fresh and Local Products.     40     rayo.jpg

In [14]:
df.to_json('veg.json')

In [15]:
df2=pd.read_json("veg.json")

In [16]:
df2

      id     name                       desc  price          img
0  vid-1  Cabbage  Fresh and Local Products.     56  cabbage.jpg
1  vid-2   Potato  Fresh and Local Products.     70   potato.jpg
2  vid-3    Onion  Fresh and Local Products.     85    onion.jpg
3  vid-4   Tomato  Fresh and Local Products.     60   tomato.jpg
4  vid-5     Rayo  Fresh and Local Products.     40     rayo.jpg

In [25]:
df2.drop(['price','desc','id'],axis='columns')

      name          img
0  Cabbage  cabbage.jpg
1   Potato   potato.jpg
2    Onion    onion.jpg
3   Tomato   tomato.jpg
4     Rayo     rayo.jpg